### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/lambda/lambda-instrumented`

❌ **Plan Status:** Failed
✅ **Format Check:** Passed

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m03:17:55.427[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.external.archive_prepare[0]: Reading...
[0;90m03:17:56.010[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role[0]: Reading...
[0;90m03:17:56.010[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Reading...
[0;90m03:17:56.010[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Reading...
[0;90m03:17:56.010[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Reading...
[0;90m03:17:56.010[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.additional_inline[0]: Reading...
[0;90m03:17:56.014[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1425019725]
[0;90m03:17:56.014[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Read complete after 0s [id=eu-south-2]
[0;90m03:17:56.014[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
[0;90m03:17:56.014[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Read complete after 0s [id=aws]
[0;90m03:17:56.014[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy.vpc[0]: Reading...
[0;90m03:17:56.134[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Read complete after 0s [id=743199288519]
[0;90m03:17:56.210[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= read (data resources)
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform planned the following actions, but then encountered a problem:
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # data.aws_iam_policy_document.logs[0] will be read during apply
[0;90m03:17:56.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (config refers to values not yet known)
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_iam_policy_document" "logs" {
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id            = (known after apply)
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + json          = (known after apply)
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + minified_json = (known after apply)
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + statement {
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + actions   = [
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:CreateLogGroup",
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:CreateLogStream",
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:PutLogEvents",
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + effect    = "Allow"
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + resources = (known after apply)
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_cloudwatch_log_group.lambda[0] will be created
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_group" "lambda" {
[0;90m03:17:56.334[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                         = (known after apply)
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + deletion_protection_enabled = (known after apply)
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                          = (known after apply)
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_class             = (known after apply)
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                        = "/aws/lambda/hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix                 = (known after apply)
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                      = "eu-south-2"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + retention_in_days           = 0
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy                = false
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                        = {
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m03:17:56.335[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                    = {
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m03:17:56.336[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role.lambda[0] will be created
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role" "lambda" {
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                   = (known after apply)
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assume_role_policy    = jsonencode(
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action    = "sts:AssumeRole"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect    = "Allow"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Principal = {
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Service = "lambda.amazonaws.com"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + create_date           = (known after apply)
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_detach_policies = true
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                    = (known after apply)
[0;90m03:17:56.337[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + managed_policy_arns   = (known after apply)
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_session_duration  = 3600
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                  = "hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix           = (known after apply)
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path                  = "/"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                  = {
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all              = {
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m03:17:56.338[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + unique_id             = (known after apply)
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inline_policy (known after apply)
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy.additional_inline[0] will be created
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy" "additional_inline" {
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "hands-on-datadog-instrumented-eu-south-2-inline"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy      = jsonencode(
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = "kms:Decrypt"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = "*"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Sid      = "kmsdecrypt"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = "ssm:GetParameter"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = "arn:aws:ssm:eu-south-2:743199288519:parameter/labs/datadog/DD_API_KEY"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Sid      = "ssmread"
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:17:56.339[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy.logs[0] will be created
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy" "logs" {
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "hands-on-datadog-instrumented-eu-south-2-logs"
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy      = (known after apply)
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy.vpc[0] will be created
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy" "vpc" {
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "hands-on-datadog-instrumented-eu-south-2-vpc"
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy      = jsonencode(
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m03:17:56.340[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = [
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:CreateNetworkInterface",
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:DescribeNetworkInterfaces",
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:DeleteNetworkInterface",
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:AssignPrivateIpAddresses",
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + "ec2:UnassignPrivateIpAddresses",
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        ]
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = "*"
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 5 to add, 0 to change, 0 to destroy.
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_cloudwatch_log_group_arn  = (known after apply)
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_cloudwatch_log_group_name = "/aws/lambda/hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.341[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_arn_static       = "arn:aws:lambda:eu-south-2:743199288519:function:hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.342[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_role_arn                  = (known after apply)
[0;90m03:17:56.342[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_role_name                 = "hands-on-datadog-instrumented-eu-south-2"
[0;90m03:17:56.342[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_role_unique_id            = (known after apply)
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0mError: External Program Execution Failed
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0m  with data.external.archive_prepare[0],
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0m  on package.tf line 10, in data "external" "archive_prepare":
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0m  10:   program = [local.python, "${path.module}/package.py", "prepare"]
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0mThe data source received an unexpected error while attempting to execute the
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0mprogram.
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0mProgram: /usr/bin/python3
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0mError Message: Could not locate source_path
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0m"./src".
[0;90m03:17:56.342[0m [0;31mSTDERR[0m [0;36mterraform: [0mPaths are relative to directory where `terraform plan` is being run
[0;90m03:17:56.343[0m [0;31mSTDERR[0m [0;36mterraform: [0m("./.terragrunt-cache/X5QM9SUl9u07uujmxiEGimSuIeY/msTJz1NbXvWYrenTve3LsBEyUTo")
[0;90m03:17:56.343[0m [0;31mSTDERR[0m [0;36mterraform: [0mState: exit status 1
[0;90m03:17:56.596[0m [0;37mSTDOUT[0m [0;36mterraform: [0m::error::Terraform exited with code 1.
[0;90m03:17:56.604[0m [0;31mERROR [0m terraform invocation failed in ./.terragrunt-cache/X5QM9SUl9u07uujmxiEGimSuIeY/msTJz1NbXvWYrenTve3LsBEyUTo
[0;90m03:17:56.604[0m [0;31mERROR [0m error occurred:

* Failed to execute "terraform plan -input=false -no-color" in ./.terragrunt-cache/X5QM9SUl9u07uujmxiEGimSuIeY/msTJz1NbXvWYrenTve3LsBEyUTo
  
  Error: External Program Execution Failed
  
    with data.external.archive_prepare[0],
    on package.tf line 10, in data "external" "archive_prepare":
    10:   program = [local.python, "${path.module}/package.py", "prepare"]
  
  The data source received an unexpected error while attempting to execute the
  program.
  
  Program: /usr/bin/python3
  Error Message: Could not locate source_path
  "./src".
  Paths are relative to directory where `terraform plan` is being run
  ("./.terragrunt-cache/X5QM9SUl9u07uujmxiEGimSuIeY/msTJz1NbXvWYrenTve3LsBEyUTo")
  
  State: exit status 1
  
  exit status 1


```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22653468128)*